In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
%matplotlib inline

In [3]:
df = pd.read_csv(r'C:\Users\arjun\OneDrive\Desktop\Dowloads from AI\titanic.csv')

In [4]:
df["Cabin Info"] = np.where(df['Cabin'].isnull(),0, 1)

In [5]:
df['Family size'] = df['SibSp'] + df['Parch']

In [6]:
df.drop(['Ticket','Cabin','Embarked','Name','PassengerId','SibSp', 'Parch'],axis =1 , inplace = True)

In [7]:
df.head()

   Survived  Pclass     Sex   Age     Fare  Cabin Info  Family size
0         0       3    male  22.0   7.2500           0            1
1         1       1  female  38.0  71.2833           1            1
2         1       3  female  26.0   7.9250           0            0
3         1       1  female  35.0  53.1000           1            1
4         0       3    male  35.0   8.0500           0            0

In [8]:
df.isnull().sum()

Survived         0
Pclass           0
Sex              0
Age            177
Fare             0
Cabin Info       0
Family size      0
dtype: int64

In [9]:
df['Age'].fillna(df['Age'].mean(),inplace =True)

In [10]:
df.isnull().sum()

Survived       0
Pclass         0
Sex            0
Age            0
Fare           0
Cabin Info     0
Family size    0
dtype: int64

In [14]:
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [15]:
df.head()

   Survived  Pclass     Sex   Age     Fare  Cabin Info  Family size
0         0       3    male  22.0   7.2500           0            1
1         1       1  female  38.0  71.2833           1            1
2         1       3  female  26.0   7.9250           0            0
3         1       1  female  35.0  53.1000           1            1
4         0       3    male  35.0   8.0500           0            0

In [16]:
dict_1 = {'male': 0, 'female': 1}

df['Sex'] = df['Sex'].map(dict_1)
df.head()

   Survived  Pclass  Sex   Age     Fare  Cabin Info  Family size
0         0       3    0  22.0   7.2500           0            1
1         1       1    1  38.0  71.2833           1            1
2         1       3    1  26.0   7.9250           0            0
3         1       1    1  35.0  53.1000           1            1
4         0       3    0  35.0   8.0500           0            0

In [17]:
df.head()

   Survived  Pclass  Sex   Age     Fare  Cabin Info  Family size
0         0       3    0  22.0   7.2500           0            1
1         1       1    1  38.0  71.2833           1            1
2         1       3    1  26.0   7.9250           0            0
3         1       1    1  35.0  53.1000           1            1
4         0       3    0  35.0   8.0500           0            0

In [18]:
df.to_csv('titanic-cleaned.csv',index= False)

In [19]:
df_Cleaned = pd.read_csv('titanic-cleaned.csv')

In [20]:
df.head()

   Survived  Pclass  Sex   Age     Fare  Cabin Info  Family size
0         0       3    0  22.0   7.2500           0            1
1         1       1    1  38.0  71.2833           1            1
2         1       3    1  26.0   7.9250           0            0
3         1       1    1  35.0  53.1000           1            1
4         0       3    0  35.0   8.0500           0            0